----   ╭────────────────────────────────╮      ____  __    ___  ____  __    ____  ____  ____       │
----   │ ⠐⠉⣿                            │     (  __)/ _\  / __)(  __)(  )  (  __)/ ___)/ ___)      │
----   │⢀⡀ ⣿                            │      ) _)/    \( (__  ) _) / (_/\ ) _) \___ \\___ \      │
----   │⠘⠳⠶⠛⠀⠀⠀⠀      ⠀⢀⣠⠤⠤⠤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀  │     (__) \_/\_/ \___)(____)\____/(____)(____/(____/      │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠊⠁⣠⣶⣶⠞⠃⢠⣹⣷⠀⠀⠀⠀⠀⠀  │             __  ____  ____  ____  ____  ____             │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡞⠀⠀⣼⣿⣿⠃⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀  │           _(  )(  __)/ ___)(_  _)(  __)(  _ \            │
----   │ ⠀⠀⠀⠀⢀⣠⣤⣤⣤⣀⢸⠀⠀⠀⣿⣿⣿⡀⠀⣀⡠⠤⠤⢤⣀⠀⠀⠀⠀  │          / \) \ ) _) \___ \  )(   ) _)  )   /            │
----   │ ⠀⠀⢀⣾⣿⣿⠿⣿⣿⣿⣿⠀⠀⠀⣿⣿⣿⡷⠊⠀⠀⠀⠀⣀⠀⠙⢆⠀⠀  │          \____/(____)(____/ (__) (____)(__\_)            │
----   │ ⠀⠀⣾⡟⢁⣀⡀⠀⠈⠻⣿⠀⠀⠀⢹⣿⣿⠁⠀⠀⣠⣾⣿⣿⣿⣷⡌⡆⠀  │                                                          │
----   │ ⠀⠀⢻⡵⠁⠀⠈⢢⠀⠀⢹⡆⠀⢀⣀⣻⣇⣀⣀⣰⣿⣿⡿⠋⠁⠈⢻⠇⠀  │  ╓                                                       │
----   │ ⠀⠀⠈⠥⣄⠀⠀⠀⣇⣴⠶⠿⠛⠛⠉⠉⠉⠙⠛⠛⠻⢿⠀⠀⠀⢀⠐⣤⠀  │  ║  Довольно просто различить шута и дурака:             │
----   │  ⠀⠘⠿⠟⠀⠀⠀⡟⠁⠀⠀⠀⠀⠀⠀⠰⡄⢀⣀⠀⣼⠀⠀⠀⠘⠿⠟⠀  │  ║  Ведь, тот — дурак, кто на шута взирает свысока!      │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⣷⣀⣇⠀⠀⠀⢀⣠⣴⣿⠟⠁⠀⣿⠀⠀⠀⠀⠀⠀⠀  │  ╙                                                       │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⠈⣏⢻⠛⠃⠀⠀⠉⠉⠹⡄⠀⠀⢹⠀⠀⠀⠀⠀⠀⠀  │                                                          │
----   │  ⠀⠀⠀⠀⠀⠀⠀⠀⠘⣆⠁⠀⠺⠂   ⠁⠀⢀⡟⠀⠀⠀⠀⠀⠀⠀  │                                                          │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢦⡀ ⠺⠂  ⠀⣠⠏⠀⠀⠀⠀⠀⠀⠀⠀  │                                                          │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢦⡀⠺⠂⣠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀  │        ╭── GitHub ─────────────────────────────╮         │
----   │ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠛⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠔⢲⡆│                                                          │
----   │                              ⢸⡇│            https://github.com/facelessJester             │
----   │                            ⠿⣤⡼⠇│                                                          │
----   ╰────────────────────────────────╯        ╰────────────────────────────── GitHub ─╯         │
----
---------------------------------------------------------------------------------------------------
----                 ╔═══════════════════════════════════════════════════════════╗
----                 ║                                                           ║
----                 ║                           PLUGS                           ║
----                 ║                                                           ║
----                 ╚═══════════════════════════════════════════════════════════╝
return {
    ----├───────────────────────────────────────┤ MANAGERS ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. mason-org/mason.nvim................менеджер внешних инструментов                    █
    ---- █                                                                                         █
    ---- █ 2. jay-babu/mason-nvim-dap.nvim........объединяет mason.nvim и nvim-dap                 █
    ---- ▼                                                                                         ▼
    { "mason-org/mason.nvim" },
    { "jay-babu/mason-nvim-dap.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ MANAGERS ╞═══════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ THEMES ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. folke/tokyonight.nvim:..............тема                                             █
    ---- █                                                                                         █
    ---- █ 2. catppuccin/nvim:....................тема                                             █
    ---- █                                                                                         █
    ---- █ 3. eldritch-theme/eldritch.nvim:.......тема                                             █
    ---- █                                                                                         █
    ---- █ 4. nvim-mini/mini.icons:...............иконки                                           █
    ---- █                                                                                         █
    ---- █ 5. nvim-tree/nvim-web-devicons:........иконки                                           █
    ---- ▼                                                                                         ▼
    { "folke/tokyonight.nvim", priority = 1000 },
    -- { "catppuccin/nvim", name = "catppuccin", priority = 1000 },
    -- { "eldritch-theme/eldritch.nvim", priority = 1000 },
    { "nvim-mini/mini.icons" },
    { "nvim-tree/nvim-web-devicons" },
    ----
    ----╞════════════════════════════════════════╡ THEMES ╞════════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ UTILITY  ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. folke/snacks.nvim:..................пакет плагинов                                   █
    ---- █                                                                                         █
    ---- █ 2. nvim-lua/plenary.nvim:..............графическая либа                                 █
    ---- █                                                                                         █
    ---- █ 3. nvim-neotest/nvim-nio:..............                                                 █
    ---- █                                                                                         █
    ---- █ 4. antoinemadec/FixCursorHold.nvim:....                                                 █
    ---- ▼                                                                                         ▼
    { "folke/snacks.nvim" },
    { "nvim-lua/plenary.nvim" },
    { "nvim-neotest/nvim-nio" },
    { "antoinemadec/FixCursorHold.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ UTILITY  ╞═══════════════════════════════════════╡
    ----

    ----
    ----├─────────────────────────────────────────┤ LSP  ├─────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. nvim-lspconfig:.....................настройка lsp конфигов                           █
    ---- █                                                                                         █
    ---- █ 2. lspkind.nvim:.......................позваляет нормально работать lsp для nvim        █
    ---- █                                          конфигов на lua                                █
    ---- █                                                                                         █
    ---- █ 3. dropbar.nvim:.......................работа со вкладками                              █
    ---- █                                                                                         █
    ---- █ 4. folke/lazydev.nvim:.................                                                 █
    ---- █                                                                                         █
    ---- █ 5. goto-preview:.......................предварительный просмотр                         █
    ---- █                                                                                         █
    ---- █ 6. iwataka/quickref.vim:...............                                                 █
    ---- █                                                                                         █
    ---- █ 7. aznhe21/actions-preview.nvim:.......предварительный просмотр исправлений             █
    ---- █                                                                                         █
    ---- █ 8. mfussenegger/nvim-lint:.............линтнер                                          █
    ---- █                                                                                         █
    ---- █ 9. j-hui/fidget.nvim:..................показывает процесс загрузки lsp сервера          █
    ---- ▼                                                                                         ▼
    { "neovim/nvim-lspconfig" },
    { "onsails/lspkind.nvim" },
    {
        "Bekaboo/dropbar.nvim",
        dependencies = { "nvim-telescope/telescope-fzf-native.nvim", build = "make" }
    },
    {
        "folke/lazydev.nvim",
        ft = "lua",
        opts = { library = { { path = "${3rd}/luv/library", words = { "vim%.uv" } } } }
    },
    { "aznhe21/actions-preview.nvim" },
    {
        "rmagatti/goto-preview",
        dependencies = { "rmagatti/logger.nvim" },
        event = "BufEnter",
        lazy = true
    },
    -- { "iwataka/quickref.vim" },
    { "mfussenegger/nvim-lint" },
    { "j-hui/fidget.nvim" },
    ----
    ----╞═════════════════════════════════════════╡ LSP  ╞═════════════════════════════════════════╡
    ----

    ----
    ----├──────────────────────────────────────┤ TREESITTER ├──────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. nvim-treesitter:....................улучшенное цветовое выделение текста             █
    ---- █                                                                                         █
    ---- █ 2. tree-sitter-markdown:...............настройка lsp конфигов                           █
    ---- █                                                                                         █
    ---- █ 3. folke/paint.nvim:...................настройка lsp конфигов                           █
    ---- ▼                                                                                         ▼
    { "nvim-treesitter/nvim-treesitter", branch = "master", lazy = false, build = ":TSUpdate" },
    { "tree-sitter-grammars/tree-sitter-markdown" },
    { "folke/paint.nvim" },
    ----
    ----╞══════════════════════════════════════╡ TREESITTER ╞══════════════════════════════════════╡
    ----

    ----
    ----├─────────────────────────────────────────┤ CMP  ├─────────────────────────────────────────┤
    ---------- 1. blink.cmp:..........................автодополнение
    { "saghen/blink.cmp", version = "1.*" },
    ----
    ----╞═════════════════════════════════════════╡ CMP  ╞═════════════════════════════════════════╡
    ----

    ----
    ----├─────────────────────────────────────┤ CMP.SNIPPETS ├─────────────────────────────────────┤
    ----
    ----╞═════════════════════════════════════╡ CMP.SNIPPETS ╞═════════════════════════════════════╡
    ----

    ----
    ----├──────────────────────────────────────┤ FORMATTERS ├──────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. conform.nvim:.......................форматирует код после сохранения                 █
    ---- ▼                                                                                         ▼
    { "stevearc/conform.nvim" },
    ----
    ----╞══════════════════════════════════════╡ FORMATTERS ╞══════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ PRETTY ├────────────────────────────────────────┤
    ---- ▲																					       ▲
    ---- █ 1. nvim-ufo:...........................настройка сворачивающегося кода (папок)    	   █
    ---- █                                                                                 	       █
    ---- █ 2. hlchunk.nvim:.......................настройка подсветки отступов             	       █
    ---- █                                                                                 	       █
    ---- █ 3. todo-comments.nvim:.................подсветка в коментах TODO, FIX, и тд.    	       █
    ---- █                                                                                 	       █
    ---- █ 4. luukvbaal/statuscol.nvim:...........кастомизация столбцов слева от кода (текущая     █
    ---- █  										строка, свернутые блоки кода, ошибки, 	       █
    ---- █  										точки остановы и т.д.)				  	       █
    ---- █                                                                                 	       █
    ---- █ 5. lukas-reineke/virt-column.nvim:.....огнаничение по символам в строке в виде полосы   █
    ---- █                                                                                 	       █
    ---- █ 6. folke/zen-mode.nvim:................режим просмотра без всего лишнего        	       █
    ---- █                                                                                 	       █
    ---- █ 7. folke/twilight.nvim:................затемняет блоки кода                     	       █
    ---- ▼                                                                                         ▼
    { "kevinhwang91/nvim-ufo", dependencies = "kevinhwang91/promise-async" },
    { "shellRaining/hlchunk.nvim", event = { "BufReadPre", "BufNewFile" } },
    { "folke/todo-comments.nvim" },
    { "luukvbaal/statuscol.nvim" },
    { "lukas-reineke/virt-column.nvim" },
    { "folke/zen-mode.nvim" },
    { "folke/twilight.nvim" },
    ----
    ----╞════════════════════════════════════════╡ PRETTY ╞════════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ WRITING  ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1.  m4xshen/autoclose.nvim:............автодополнение и удаление скобок                 █
    ---- █                                                                                         █
    ---- █ 2.  kylechui/nvim-surround:............с помощью биндов выстро выделяем слова           █
    ---- █ знаками скобками                                                                        █
    ---- █                                                                                         █
    ---- █ 3.  Wansmer/treesj:....................сворачивание/разворачивание блоков кода          █
    ---- █                                                                                         █
    ---- █ 4.  max397574/better-escape.nvim:......быстрый выход из режима вставки                  █
    ---- █                                                                                         █
    ---- █ 5.  jake-stewart/multicursor.nvim:.....изменение несколько точек одновременно           █
    ---- █                                                                                         █
    ---- █ 6.  danymat/neogen:....................быстрое создание анотаций                        █
    ---- █                                                                                         █
    ---- █ 7.  uga-rosa/ccc.nvim:.................позволяет менять наглядно цвета, а также         █
    ---- █                                          подсвечивает их                                █
    ---- █                                                                                         █
    ---- █ 8.  numToStr/Comment.nvim:.............учимся комментировать                            █
    ---- █                                                                                         █
    ---- █ 9.  LudoPinelli/comment-box.nvim:......оформление комментариев                          █
    ---- █                                                                                         █
    ---- █ 10. nvim-mini/mini.move:...............перетаскивание строк                             █
    ---- █                                                                                         █
    ---- █ 11. nvim-mini/mini.align:..............                                                 █
    ---- █                                                                                         █
    ---- █ 12. hat0uma/csvview.nvim:..............                                                 █
    ---- █                                                                                         █
    ---- █ 13. AckslD/muren.nvim:.................                                                 █
    ---- █                                                                                         █
    ---- █ 14. nvim-pack/nvim-spectre:............поиск и замена слов                              █
    ---- █                                                                                         █
    ---- █ 15. jbyuki/venn.nvim:..................рисование графиков                               █
    ---- ▼                                                                                         ▼
    { "m4xshen/autoclose.nvim" },
    { "kylechui/nvim-surround", version = "^3.0.0", event = "VeryLazy" },
    { "Wansmer/treesj" },
    { "max397574/better-escape.nvim" },
    { "jake-stewart/multicursor.nvim", branch = "1.0" },
    { "danymat/neogen" },
    { "uga-rosa/ccc.nvim" },
    { "numToStr/Comment.nvim" },
    { "LudoPinelli/comment-box.nvim" },
    { "nvim-mini/mini.move", version = "*" },
    { 'nvim-mini/mini.align', version = '*' },
    { "hat0uma/csvview.nvim", cmd = { "CsvViewEnable", "CsvViewDisable", "CsvViewToggle" } },
    --- AckslD/muren.nvim
    { "nvim-pack/nvim-spectre" },
    { "jbyuki/venn.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ WRITING  ╞═══════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ MOTION ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. ggandor/leap.nvim...................удобные прыжки по видимой части буфера           █
    ---- █                                                                                         █
    ---- █ 2. chrisgrieser/nvim-spider............более удобное перемежение.                       █
    ---- ▼                                                                                         ▼
    { "ggandor/leap.nvim" },
    { "chrisgrieser/nvim-spider", lazy = true },
    ----
    ----╞════════════════════════════════════════╡ MOTION ╞════════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ SEARCH ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. ibhagwan/fzf-lua....................удобные прыжки по видимой части буфера           █
    ---- █                                                                                         █
    ---- █ 2. nvim-telescope/telescope.nvim.......расширяемый нечеткий поисковик всего             █
    ---- ▼                                                                                         ▼
    { "ibhagwan/fzf-lua" },
    {
        "nvim-telescope/telescope.nvim",
        branch = "0.1.x",
        dependencies = { "nvim-lua/plenary.nvim" }
    },
    ----
    ----╞════════════════════════════════════════╡ SEARCH ╞════════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ BUFFERS  ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. nanozuki/tabby.nvim.................удобные прыжки по видимой части буфера           █
    ---- █                                                                                         █
    ---- █ 2. j-morano/buffer_manager.nvim........расширяемый нечеткий поисковик всего             █
    ---- █                                                                                         █
    ---- █ 3. leath-dub/snipe.nvim................                                                 █
    ---- █                                                                                         █
    ---- █ 4. ojroques/nvim-bufdel................                                                 █
    ---- █                                                                                         █
    ---- █ 5. kazhala/close-buffers.nvim..........                                                 █
    ---- █                                                                                         █
    ---- █ 6. nvim-lualine/lualine.nvim...........расширяемый нечеткий поисковик всего             █
    ---- █                                                                                         █
    ---- █ 7. letieu/harpoon-lualine..............размещение текущих меток на lualine              █
    ---- ▼                                                                                         ▼
    { "nanozuki/tabby.nvim" },
    { "j-morano/buffer_manager.nvim" },
    -- { "leath-dub/snipe.nvim" }
    -- { "ojroques/nvim-bufdel" }
    -- { "kazhala/close-buffers.nvim" }
    { "nvim-lualine/lualine.nvim" },
    { "letieu/harpoon-lualine" },
    ----
    ----╞═══════════════════════════════════════╡ BUFFERS  ╞═══════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ WINDOWS  ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. folke/edgy.nvim.....................макеты окон                                      █
    ---- █                                                                                         █
    ---- █ 2. aserowy/tmux.nvim...................tmux                                             █
    ---- ▼                                                                                         ▼
    -- { "folke/edgy.nvim" },
    --- { "aserowy/tmux.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ WINDOWS  ╞═══════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ MARKS  ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. ThePrimeagen/harpoon................более удобные метки между файлами                █
    ---- █                                                                                         █
    ---- █ 2. chentoast/marks.nvim................отображение меток в столбце                      █
    ---- █                                                                                         █
    ---- █ 3. otavioschwanck/arrow.nvim...........подобие harpoon                                  █
    ---- ▼                                                                                         ▼
    { "ThePrimeagen/harpoon", branch = "harpoon2" },
    { "chentoast/marks.nvim" },
    { "otavioschwanck/arrow.nvim" },
    ----
    ----╞════════════════════════════════════════╡ MARKS  ╞════════════════════════════════════════╡
    ----

    ----
    ----├─────────────────────────────────────┤ DIAGNOSTICS  ├─────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. folke/trouble.nvim..................диагностика кода                                 █
    ---- ▼                                                                                         ▼
    { "folke/trouble.nvim" },
    ----
    ----╞═════════════════════════════════════╡ DIAGNOSTICS  ╞═════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ TESTS  ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. nvim-neotest/neotest................управление тестами                               █
    ---- █                                                                                         █
    ---- █ 2. xeluxee/competitest.nvim............тесты удобные для олимпиадного                   █
    ---- █                                          программирования                               █
    ---- ▼                                                                                         ▼
    { "nvim-neotest/neotest" },
    --- { "xeluxee/competitest.nvim" },
    ----
    ----╞════════════════════════════════════════╡ TESTS  ╞════════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ DEBUG  ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. mfussenegger/nvim-dap...............debug adapter protocol                           █
    ---- █                                                                                         █
    ---- █ 2. rcarriga/nvim-dap-ui................графический интерфейс для dap                    █
    ---- █                                                                                         █
    ---- █ 3. theHamsta/nvim-dap-virtual-text.....dap подсветка                                    █
    ---- █                                                                                         █
    ---- █ 5. igorlfs/nvim-dap-view...............отладка кода                                     █
    ---- ▼                                                                                         ▼
    { "mfussenegger/nvim-dap" },
    { "rcarriga/nvim-dap-ui", dependencies = { "mfussenegger/nvim-dap", "nvim-neotest/nvim-nio" } },
    { "theHamsta/nvim-dap-virtual-text" },
    --- { "igorlfs/nvim-dap-view" },
    ----
    ----╞════════════════════════════════════════╡ DEBUG  ╞════════════════════════════════════════╡
    ----

    ----
    ----├─────────────────────────────────────────┤ GIT  ├─────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. jesseduffield/lazygit...............tui для git                                      █
    ---- █                                                                                         █
    ---- █ 2. sindrets/diffview.nvim..............просмотр изменений файлов в git                  █
    ---- █                                                                                         █
    ---- █ 4. lewis6991/gitsigns.nvim.............интеграция git в nvim                            █
    ---- █                                                                                         █
    ---- █ 5. pwntester/octo.nvim.................редактирование                                   █
    ---- █ запросов, дисскусий и т.д. из nvim                                                      █
    ---- █                                                                                         █
    ---- █ 6. NeogitOrg/neogit....................аналог lazy git                                  █
    ---- ▼                                                                                         ▼
    {
        "kdheepak/lazygit.nvim",
        lazy = true,
        cmd = {
            "LazyGit",
            "LazyGitConfig",
            "LazyGitCurrentFile",
            "LazyGitFilter",
            "LazyGitFilterCurrentFile"
        },
        dependencies = { "nvim-lua/plenary.nvim" }
    },
    { "sindrets/diffview.nvim" },
    { "tpope/vim-fugitive" },
    { "lewis6991/gitsigns.nvim" },
    --- { "pwntester/octo.nvim" },
    --- { "NeogitOrg/neogit" },
    ----
    ----╞═════════════════════════════════════════╡ GIT  ╞═════════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ SESSIONS ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. olimorris/persisted.nvim............                                                 █
    ---- █                                                                                         █
    ---- █ 2. Shatur/neovim-session-manager.......                                                 █
    ---- ▼                                                                                         ▼
    --- { "olimorris/persisted.nvim" },
    --- { "Shatur/neovim-session-manager" },
    ----
    ----╞═══════════════════════════════════════╡ SESSIONS ╞═══════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ PROJECTS ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. natecraddock/workspaces.nvim........сохраниние папок проектов и быстрый доступ к ним █
    ---- ▼                                                                                         ▼
    { "natecraddock/workspaces.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ PROJECTS ╞═══════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ TAGGING  ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. cbochs/grapple.nvim.................                                                 █
    ---- ▼                                                                                         ▼
    --- { "cbochs/grapple.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ TAGGING  ╞═══════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ RUNNERS  ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. Vigemus/iron.nvim...................                                                 █
    ---- █                                                                                         █
    ---- █ 3. stevearc/overseer.nvim..............                                                 █
    ---- █                                                                                         █
    ---- █ 4. Zeioth/compiler.nvim................                                                 █
    ---- █                                                                                         █
    ---- █ 5. CRAG666/code_runner.nvim............                                                 █
    ---- ▼                                                                                         ▼
    { "Vigemus/iron.nvim" },
    { "stevearc/overseer.nvim", opts = {} },
    -- { "Zeioth/compiler.nvim" },
    -- { "CRAG666/code_runner.nvim" },
    ----
    ----╞═══════════════════════════════════════╡ RUNNERS  ╞═══════════════════════════════════════╡
    ----

    ----
    ----├───────────────────────────────────────┤ EXPLOERS ├───────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. stevearc/oil.nvim...................файловый менеджер, который позволяет             █
    ---- █ редактировать файловую систему как буффер                                               █
    ---- █                                                                                         █
    ---- █ 2. refractalize/oil-git-status.nvim....git для файлового менеджера oil                  █
    ---- ▼                                                                                         ▼
    {
        "stevearc/oil.nvim",
        opts = {},
        dependencies = { { "nvim-mini/mini.icons", opts = {} } },
        lazy = false
    },
    { "refractalize/oil-git-status.nvim", config = true },
    ----
    ----╞═══════════════════════════════════════╡ EXPLOERS ╞═══════════════════════════════════════╡
    ----

    ----
    ----├──────────────────────────────────────────┤ UI ├──────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. folke/noice.nvim....................всплывающие уведы, модификация cmd               █
    ---- █                                                                                         █
    ---- █ 2. akinsho/toggleterm.nvim.............терминал                                         █
    ---- █                                                                                         █
    ---- █ 3. nvimdev/lspsaga.nvim................пакет графических инструментов                   █
    ---- █                                                                                         █
    ---- █ 4. goolord/alpha-nvim..................аналог dashboard                                 █
    ---- ▼                                                                                         ▼
    {
        "folke/noice.nvim",
        event = "VeryLazy",
        dependencies = { "MunifTanjim/nui.nvim", "rcarriga/nvim-notify" }
    },
    { "akinsho/toggleterm.nvim" },
    --- { "nvimdev/lspsaga.nvim" },
    --- { "goolord/alpha-nvim" },
    ----
    ----╞══════════════════════════════════════════╡ UI ╞══════════════════════════════════════════╡
    ----

    ----
    ----├─────────────────────────────────────┤ UI.ANIMATION ├─────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. karb94/neoscroll.nvim...............плавная прокрутка                                █
    ---- █                                                                                         █
    ---- █ 2. sphamba/smear-cursor.nvim...........анимированный курсор                             █
    ---- ▼                                                                                         ▼
    { "karb94/neoscroll.nvim" },
    { "sphamba/smear-cursor.nvim" },
    ----
    ----╞═════════════════════════════════════╡ UI.ANIMATION ╞═════════════════════════════════════╡
    ----

    ----
    ----├──────────────────────────────────────┤ PREIVIEWS  ├──────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. toppair/peek.nvim...................                                                 █
    ---- █                                                                                         █
    ---- █ 2. chomosuke/typst-preview.nvim........                                                 █
    ---- ▼                                                                                         ▼
    ---
    ---toppair/peek.nvim
    ---chomosuke/typst-preview.nvim
    ----
    ----╞══════════════════════════════════════╡ PREIVIEWS  ╞══════════════════════════════════════╡
    ----

    ----
    ----├──────────────────────────────────────┤ LANGUAGES  ├──────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. render-markdown.nvim................рендеринг markdown в буфере                      █
    ---- █                                                                                         █
    ---- █ 2. mrcjkb/rustaceanvim.................                                                 █
    ---- ▼                                                                                         ▼
    { "MeanderingProgrammer/render-markdown.nvim" },
    ---mrcjkb/rustaceanvim
    ----
    ----╞══════════════════════════════════════╡ LANGUAGES  ╞══════════════════════════════════════╡
    ----

    ----
    ----├────────────────────────────────────────┤ KEYMAP ├────────────────────────────────────────┤
    ---- ▲                                                                                         ▲
    ---- █ 1. folke/which-key.nvim................                                                 █
    ---- ▼                                                                                         ▼
    { "folke/which-key.nvim" }
    ----
    ----╞════════════════════════════════════════╡ KEYMAP ╞════════════════════════════════════════╡
}
